Repository: Microcodice/wp-crash-guard
Catalog: wp-crash-guard-*.po
Languages: it_it

source: Restoring Site...
it_it: Ripristino del sito...

source: Restoring your site...
it_it: Ripristino del sito in corso...

source: Please wait, the site is being restored after a critical error.
it_it: Attendere prego, il sito è in fase di ripristino dopo un errore critico.

source: Plugin deactivated after critical error:
it_it: Plugin disattivato dopo errore critico:

source: Error:
it_it: Errore:

source: File: %s on line %s
it_it: File: %s alla riga %s

source: Error Intercepted - WP Crash Guard
it_it: Errore Intercettato - WP Crash Guard

source: Error Intercepted!
it_it: Errore Intercettato!

source: has detected a critical error caused by the plugin:
it_it: ha rilevato un errore critico causato dal plugin:

source: The plugin will be automatically deactivated on the next page load.
it_it: Il plugin verrà automaticamente disattivato al prossimo caricamento della pagina.

source: Reload the page
it_it: Ricarica la pagina

source: Go to Dashboard
it_it: Vai alla Bacheca

source: Updating...
it_it: Aggiornamento...

source: The page will reload automatically in %s seconds.
it_it: La pagina si ricaricherà automaticamente tra %s secondi.

source: Maintenance
it_it: Manutenzione

source: The site is temporarily under maintenance.
it_it: Il sito è temporaneamente in manutenzione.

source: Maintenance in progress
it_it: Manutenzione in corso

source: We are performing some updates.
it_it: Stiamo eseguendo alcuni aggiornamenti.

source: The site will be available in a few moments.
it_it: Il sito sarà disponibile tra pochi istanti.

source: The page will refresh automatically...
it_it: La pagina si aggiornerà automaticamente...

source: Error detected:
it_it: Errore rilevato:

source: Plugin deactivated:
it_it: Plugin disattivato:

source: detected in dry run mode
it_it: rilevato in modalità dry run

source: automatically deactivated
it_it: disattivato automaticamente

source: Error intercepted by WP Crash Guard
it_it: Errore intercettato da WP Crash Guard

source: The plugin <strong>%s</strong> has caused a critical error and has been %s.
it_it: Il plugin <strong>%s</strong> ha causato un errore critico ed è stato %s.

source: Error: %s
it_it: Errore: %s

source: A critical error has occurred
it_it: Si è verificato un errore critico

source: Settings
it_it: Impostazioni

source: Settings - WP Crash Guard
it_it: Impostazioni - WP Crash Guard

source: Installation complete! The plugin is now a Must-Use Plugin and proactively protects your site.
it_it: Installazione completata! Il plugin è ora un Must-Use Plugin e protegge proattivamente il tuo sito.

source: The plugin "%s" was automatically deactivated because it was causing a critical error.
it_it: Il plugin "%s" è stato automaticamente disattivato perché stava causando un errore critico.

source: View details
it_it: Visualizza dettagli

source: Dry Run Mode active. The plugin "%s" caused a critical error, but was not deactivated.
it_it: Modalità Dry Run attiva. Il plugin "%s" ha causato un errore critico, ma non è stato disattivato.

source: Recovery mode active. The site has been restored after a critical error.
it_it: Modalità di recupero attiva. Il sito è stato ripristinato dopo un errore critico.

source: Settings saved successfully!
it_it: Impostazioni salvate con successo!

source: WP Crash Guard protects your WordPress site by automatically deactivating plugins that cause critical errors. It is installed as a **Must-Use Plugin** to ensure maximum protection.
it_it: WP Crash Guard protegge il tuo sito WordPress disattivando automaticamente i plugin che causano errori critici. È installato come **Must-Use Plugin** per garantire la massima protezione.

source: Recent Errors
it_it: Errori Recenti

source: Action Log
it_it: Registro Azioni

source: No errors detected.
it_it: Nessun errore rilevato.

source: Error
it_it: Errore

source: Date/Time
it_it: Data/Ora

source: User
it_it: Utente

source: Memory error - consider increasing PHP memory_limit
it_it: Errore di memoria - considera di aumentare il memory_limit di PHP

source: Clear Error Log
it_it: Cancella Registro Errori

source: No actions logged.
it_it: Nessuna azione registrata.

source: Action
it_it: Azione

source: Clear Log
it_it: Cancella Registro

source: Plugin Whitelist
it_it: Whitelist Plugin

source: Select plugins that should be excluded from WP Crash Guard monitoring. Whitelisted plugins will never be deactivated, even if they cause errors.
it_it: Seleziona i plugin che devono essere esclusi dal monitoraggio di WP Crash Guard. I plugin nella Whitelist non saranno mai disattivati, anche se causano errori.

source: Search plugins...
it_it: Cerca plugin...

source: by
it_it: di

source: Active
it_it: Attivo

source: Inactive
it_it: Inattivo

source: Save Whitelist
it_it: Salva Whitelist

source: %d plugin whitelisted
it_it: %d plugin nella whitelist

source: WP Crash Guard Settings
it_it: Impostazioni WP Crash Guard

source: Behavior for Visitors
it_it: Comportamento per i Visitatori

source: Do nothing (silently deactivate plugin)
it_it: Non fare nulla (disattiva silenziosamente il plugin)

source: Automatically reload the page
it_it: Ricarica automaticamente la pagina

source: Show maintenance page
it_it: Mostra pagina di manutenzione

source: Show custom message
it_it: Mostra messaggio personalizzato

source: Stealth mode (silent redirect)
it_it: Modalità stealth (redirect silenzioso)

source: What to show visitors after deactivating the problematic plugin
it_it: Cosa mostrare ai visitatori dopo aver disattivato il plugin problematico

source: Behavior for Admins
it_it: Comportamento per gli Amministratori

source: Show full error details (blocking page)
it_it: Mostra dettagli completi dell'errore (pagina bloccante)

source: Show toast notification (non-blocking)
it_it: Mostra notifica toast (non bloccante)

source: Automatically reload
it_it: Ricarica automaticamente

source: Show nothing (dashboard notification only)
it_it: Non mostrare nulla (solo notifica nella bacheca)

source: What to show to administrators after deactivating the problematic plugin
it_it: Cosa mostrare agli amministratori dopo aver disattivato il plugin problematico

source: A temporary, non-blocking notification that appears in the top right.
it_it: Una notifica temporanea, non bloccante che appare in alto a destra.

source: Reload Delay (seconds)
it_it: Ritardo Ricaricamento (secondi)

source: Seconds to wait before automatically reloading (0 = immediate)
it_it: Secondi da attendere prima del ricaricamento automatico (0 = immediato)

source: Custom Message
it_it: Messaggio Personalizzato

source: Message to display when the "custom message" option is selected.
it_it: Messaggio da visualizzare quando è selezionata l'opzione "messaggio personalizzato".

source: You can use HTML. Leave empty to use the default message.
it_it: Puoi usare HTML. Lascia vuoto per usare il messaggio predefinito.

source: Error Interception Threshold
it_it: Soglia di Intercettazione Errori

source: Fatal Errors (E_ERROR)
it_it: Errori Fatali (E_ERROR)

source: Warnings & Above (E_WARNING)
it_it: Avvisi e Superiori (E_WARNING)

source: Notices & Above (E_NOTICE)
it_it: Notifiche e Superiori (E_NOTICE)

source: Choose the minimum error level that should trigger a plugin deactivation.
it_it: Scegli il livello minimo di errore che dovrebbe attivare la disattivazione di un plugin.

source: Fatal Errors (default):
it_it: Errori Fatali (predefinito):

source: Only intervenes for critical errors that would crash the site.
it_it: Interviene solo per errori critici che bloccherebbero il sito.

source: Warnings & Above:
it_it: Avvisi e Superiori:

source: Also intervenes for less critical warnings that could indicate a future problem.
it_it: Interviene anche per avvisi meno critici che potrebbero indicare un problema futuro.

source: Notices & Above:
it_it: Notifiche e Superiori:

source: Intervenes for all PHP issues. May lead to unintended deactivations.
it_it: Interviene per tutti i problemi PHP. Potrebbe portare a disattivazioni indesiderate.

source: Advanced Options
it_it: Opzioni Avanzate

source: Automatically deactivate problematic plugins
it_it: Disattiva automaticamente i plugin problematici

source: If disabled, it will only log the error without deactivating the plugin.
it_it: Se disabilitato, registrerà solo l'errore senza disattivare il plugin.

source: Warning:
it_it: Attenzione:

source: Disabling this option might leave the site non-functional!
it_it: Disabilitare questa opzione potrebbe lasciare il sito non funzionante!

source: Enable Dry Run Mode
it_it: Abilita Modalità Dry Run

source: In this mode, the plugin will detect and log errors but will NOT deactivate plugins.
it_it: In questa modalità, il plugin rileverà e registrerà gli errori ma NON disattiverà i plugin.

source: Useful for testing and diagnostics without impacting the live site.
it_it: Utile per test e diagnostica senza impattare sul sito live.

source: Enable error logging
it_it: Abilita registrazione errori

source: Logs all intercepted errors to the database.
it_it: Registra tutti gli errori intercettati nel database.

source: Save Settings
it_it: Salva Impostazioni

source: Settings Suggestions:
it_it: Suggerimenti Impostazioni:

source: For development/testing:
it_it: Per sviluppo/test:

source: Admin = "Toast notification", Visitors = "Do nothing"
it_it: Admin = "Notifica toast", Visitatori = "Non fare nulla"

source: For staging:
it_it: Per staging:

source: Admin = "Toast notification", Visitors = "Maintenance"
it_it: Admin = "Notifica toast", Visitatori = "Manutenzione"

source: For production:
it_it: Per produzione:

source: Admin = "Do nothing", Visitors = "Do nothing" (maximum transparency)
it_it: Admin = "Non fare nulla", Visitatori = "Non fare nulla" (massima trasparenza)

source: Mode Guide:
it_it: Guida alle Modalità:

source: Do nothing:
it_it: Non fare nulla:

source: The problematic plugin is silently deactivated without showing any messages.
it_it: Il plugin problematico viene disattivato silenziosamente senza mostrare alcun messaggio.

source: Toast notification (Admin):
it_it: Notifica toast (Admin):

source: Shows a temporary, non-blocking notification in the top right that disappears after 5 seconds.
it_it: Mostra una notifica temporanea, non bloccante in alto a destra che scompare dopo 5 secondi.

source: Deactivates the plugin and reloads the page after the set delay.
it_it: Disattiva il plugin e ricarica la pagina dopo il ritardo impostato.

source: Maintenance page:
it_it: Pagina di manutenzione:

source: Shows a professional maintenance page while the plugin is being deactivated.
it_it: Mostra una pagina di manutenzione professionale mentre il plugin viene disattivato.

source: Custom message:
it_it: Messaggio personalizzato:

source: Shows your personalized message after deactivation.
it_it: Mostra il tuo messaggio personalizzato dopo la disattivazione.

source: Stealth mode:
it_it: Modalità stealth:

source: Immediate redirect after deactivation (similar to reloading with 0 seconds).
it_it: Redirect immediato dopo la disattivazione (simile al ricaricamento con 0 secondi).

source: Note:
it_it: Nota:

source: In all modes, the problematic plugin is always deactivated (if the option is enabled). The only difference is what is shown to the user.
it_it: In tutte le modalità, il plugin problematico viene sempre disattivato (se l'opzione è abilitata). L'unica differenza è cosa viene mostrato all'utente.

source: Memory Errors:
it_it: Errori di Memoria:

source: Out of memory errors are handled with an automatic redirect for all modes to ensure site recovery.
it_it: Gli errori di memoria esaurita sono gestiti con un redirect automatico per tutte le modalità per garantire il recupero del sito.

source: Important:
it_it: Importante:

source: If you are testing and see messages you do not want, make sure you have configured the appropriate modes above.
it_it: Se stai testando e vedi messaggi che non desideri, assicurati di aver configurato le modalità appropriate sopra.
